---
kind: property
id: P:Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModel.Tier
source: html/2fd1fab5-247f-4ec9-4bc9-9840c1b6eab8.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModel.Tier Property

Level of computation for energy analysis model.

## Syntax (C#)
```csharp
public EnergyAnalysisDetailModelTier Tier { get; }
```